// pages/detail/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    info:{
      id: 11,
      title: '坐月子就得好好管住嘴，轻轻迈开腿',
      typeid: 1,
      "text": ['坐月子需要好好休养身体，但并不意味着真的是要"坐着"度过这42天。坐月子到底能不能做运动这个问题，一直是不少新妈妈心中的疑惑。', '老一辈认为，坐月子顾名思义就让人"坐着"休养，刚生完孩子身体虚弱，月子里就不要做什么运动了，等出月子再说，不然可能落下病根。', '其实，保证休息时间充足的同时，新妈妈也要配合适当的运动才能帮助身体更好的恢复。坐月子长期卧床易出现便秘、子宫脱垂、下肢浮肿等问题。', '../../images/detail1.png', '#运动助排毒事半功倍', '很多新妈妈都感觉生完了好像还是孕五六个月的样子，别慌！随着恶露的排出和身体各器官的恢复，肚子会慢慢恢复原样的，而运动对此更有促进作用。适当运动不仅可以促进恶露排出和子宫恢复，而且对缓解产后的各种酸痛也很有效。不少新妈妈产后心情郁闷，运动还能帮你缓解压力减少产后抑郁的发生。', '#好好关注嘴，轻轻迈开腿', '产后每个新妈妈身体的恢复的情况不同，适合的的运动也不同。建议新妈妈如果还有恶露，先不要进行锻炼，可以在产后第一次身体检查之后，咨询医生开始运动的时间。如果分娩时没有并发症，自我感觉身体情况良好，可以在房间里散散步。还有一些仰卧起坐的适应性锻炼，如腹式呼吸运动，可以做一些腿部和臀部锻炼，也可以通过一些情体力的家务活达到锻炼的目的。', '不得不说的是除了要迈开腿，也要管住嘴。月子期间不能节食减肥，但也不要傻傻地为了下奶就拼命多吃。坐月子食物要多样但不能过量，忌烟酒，少喝浓茶和咖啡，在正常清淡的饮食中增加富含优质蛋白质和维生素A的动物性食品和海产品。','../../images/detail2.png','#运动做不对？当心伤口裂开','/忌操之过急','过早进行幅度较大的运动容易伤到还没恢复的子宫和内脏，也可能使分娩的伤口裂开。','/需循序渐进','从呼吸运动到肌肉运动，身体和力量的复原都需要时间。','/特殊情况','剖腹产或分娩时出现并发症的新妈妈最好在医生或专业人士的指引下开展产后运动，避免对身体或伤口造成二次伤害。']
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  },
})